landor163/STM32_Stalib_EleDesignCom/User/Exti/Exti.h
#ifndef Exti_H
#define Exti_H


#include "stm32f10x.h"


//按键只是为了产生 电平变化，以此来 触发中断；
#define     KEY1_INT_GPIO_PORT          GPIOA
#define     KEY1_INT_GPIO_CLK          (RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO)
#define     KEY1_INT_GPIO_PIN          GPIO_Pin_0

#define     KEY1_INT_EXTI_PORTSOURCE   GPIO_PortSourceGPIOA
#define     KEY1_INT_EXTI_PINSOURCE    GPIO_PinSource0
#define     KEY1_INT_EXTI_LINE         EXTI_Line0
#define     KEY1_INT_EXTI_IRQ          EXTI0_IRQn

#define     KEY1_IRQHandler            EXTI0_IRQHandler


#define     KEY2_INT_GPIO_PORT         GPIOC
#define     KEY2_INT_GPIO_CLK          (RCC_APB2Periph_GPIOC|RCC_APB2Periph_AFIO)
#define     KEY2_INT_GPIO_PIN          GPIO_Pin_13

#define     KEY2_INT_EXTI_PORTSOURCE   GPIO_PortSourceGPIOC
#define     KEY2_INT_EXTI_PINSOURCE    GPIO_PinSource13
#define     KEY2_INT_EXTI_LINE         EXTI_Line13
#define     KEY2_INT_EXTI_IRQ          EXTI15_10_IRQn

#define     KEY2_IRQHandler            EXTI15_10_IRQHandler


void EXTI_Key_Config(void);
#endif /*Exti_H*/

